Расчетные_задачи_занятие_5/src/Documents/ПриказОПриеме/ПриказОПриеме.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриказОПриеме</name>
  <comment>Приказ о приеме на работу</comment>
  <registerRecords>InformationRegister.ПлановыеОсновныеНачисления</registerRecords>
  <registerRecords>InformationRegister.Сотрудники</registerRecords>
  <registerRecords>InformationRegister.ПлановыеУдержания</registerRecords>
  <registerRecords>InformationRegister.ПлановыеДополнительныеНачисления</registerRecords>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВидыГрафиковРаботы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеНачисления</name>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ОсновныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеНачисления</name>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ДополнительныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Удержания</name>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.Удержания</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Расчетные_задачи_занятие_5/src/InformationRegisters/ПлановыеОсновныеНачисления/ПлановыеОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПлановыеОсновныеНачисления</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРасчета</name>
    <type>
      <types>ChartOfCalculationTypesRef.ОсновныеНачисления</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Расчетные_задачи_занятие_5/src/Documents/ПриказОПриеме/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ПлановыеДополнительныеНачисления.Записывать = Истина;
	Движения.ПлановыеОсновныеНачисления.Записывать = Истина;
	Движения.ПлановыеУдержания.Записывать = Истина;
	Движения.Сотрудники.Записывать = Истина;
	
	Движения.Записать();
	
	ЗаполнитьНЗ_Сотрудники();
	ЗаполнитьНЗ_ПлановыеДополнительныеНачисления();
	ЗаполнитьНЗ_ПлановыеОсновныеНачисления();
	ЗаполнитьНЗ_ПлановыеУдержания();
	
	Движения.ПлановыеДополнительныеНачисления.Записывать = Истина;
	Движения.ПлановыеОсновныеНачисления.Записывать = Истина;
	Движения.ПлановыеУдержания.Записывать = Истина;
	Движения.Сотрудники.Записывать = Истина;
	
КонецПроцедуры

Процедура ЗаполнитьНЗ_Сотрудники()
	
	Движение = Движения.Сотрудники.Добавить();
	
	Движение.Период = ДатаСобытия;
	Движение.ФизическоеЛицо = ФизическоеЛицо;
	Движение.Подразделение = Подразделение;
	Движение.Должность = Должность;
	Движение.Состояние = Перечисления.СостоянияФизическогоЛица.Работает;
	Движение.ГрафикРаботы = ГрафикРаботы;
	
КонецПроцедуры

Процедура ЗаполнитьНЗ_ПлановыеОсновныеНачисления()
	
	Для Каждого ТекСтрокаОсновныеНачисления Из ОсновныеНачисления Цикл
		// регистр ПлановыеОсновныеНачисления 
		Движение = Движения.ПлановыеОсновныеНачисления.Добавить();
		Движение.Период = ДатаСобытия;
		Движение.ФизическоеЛицо = ФизическоеЛицо;
		Движение.ВидРасчета = ТекСтрокаОсновныеНачисления.ВидРасчета;
		Движение.Размер = ТекСтрокаОсновныеНачисления.Размер;
	КонецЦикла;
	
	
	
КонецПроцедуры

Процедура ЗаполнитьНЗ_ПлановыеДополнительныеНачисления()
	
	Для Каждого ТекСтрокаДополнительныеНачисления Из ДополнительныеНачисления Цикл
		// регистр ПлановыеДополнительныеНачисления 
		Движение = Движения.ПлановыеДополнительныеНачисления.Добавить();
		Движение.Период = ДатаСобытия;
		Движение.ФизическоеЛицо = ФизическоеЛицо;
		Движение.ВидРасчета = ТекСтрокаДополнительныеНачисления.ВидРасчета;
		Движение.Размер = ТекСтрокаДополнительныеНачисления.Размер;
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ЗаполнитьНЗ_ПлановыеУдержания()
	
	Для Каждого ТекСтрокаУдержания Из Удержания Цикл
		// регистр ПлановыеУдержания 
		Движение = Движения.ПлановыеУдержания.Добавить();
		Движение.Период = ДатаСобытия;
		Движение.ФизическоеЛицо = ФизическоеЛицо;
		Движение.ВидРасчета = ТекСтрокаУдержания.ВидРасчета;
		Движение.Размер = ТекСтрокаУдержания.Размер;
	КонецЦикла;
	
	
КонецПроцедуры


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсновныеНачисления.НомерСтроки,
		|	ОсновныеНачисления.ВидРасчета,
		|	ОсновныеНачисления.Размер
		|ПОМЕСТИТЬ ВТОсновныеНачисления
		|ИЗ
		|	&ОсновныеНачисления КАК ОсновныеНачисления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(ПриказОПриемеОсновныеНачисления.ВидРасчета) КАК ВидРасчета,
		|	МАКСИМУМ(ПриказОПриемеОсновныеНачисления.НомерСтроки) КАК НомерСтроки
		|ИЗ
		|	ВТОсновныеНачисления КАК ПриказОПриемеОсновныеНачисления
		|ГДЕ
		|	ПриказОПриемеОсновныеНачисления.ВидРасчета.ЗачетОтработанногоВремени = ИСТИНА";
	
	Запрос.УстановитьПараметр("ОсновныеНачисления",ОсновныеНачисления);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Если ВыборкаДетальныеЗаписи.ВидРасчета > 1 Тогда
			
			Отказ = Истина;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Для сотрудника можно указать только одно начисления, учитывающее отработанное время!";
			Сообщение.Поле = "ОсновныеНачисления[" + (ВыборкаДетальныеЗаписи.НомерСтроки - 1) + "].ВидРасчета";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			
		ИначеЕсли ВыборкаДетальныеЗаписи.ВидРасчета = 0 Тогда
			
			Отказ = Истина;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Для сотрудника нужно указать одно начисления, учитывающее отработанное время!";
			Сообщение.Поле = "ОсновныеНачисления";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
		
		КонецЕсли;
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
КонецПроцедуры
